{
  "header": {
    "presentation": "Home",
    "parcours": "Journey",
    "projects": "Projects",
    "contact": "Contact Me",
    "backhome": "Back to Home",
    "persoProjects": "Professional Projects Completed",
    "courseProjects": "University Projects Completed",
    "link": "Report",
    "seeMore": "See More"
  },
  "about": {
    "title": "Home",
    "description": "Student at EPITA majoring in SCIA-G (Data Science, AI & Graphs).\nThis site is kind of my personal lab:\nHere I share what I learn, what I build, and what inspires me."
  },
  "parcours": {
    "title": "Journey",
    "academicJourney": {
      "title": "Academic",
      "items": {
        "0": {
          "title": "EPITA",
          "date": "2023 - Today",
          "subtitle": "Paris",
          "description": "Engineering cycle – Class of 2026\nMajor SCIA-G: Data Science, Artificial Intelligence and Graphs"
        },
        "1": {
          "title": "Preparatory Classes CPGE",
          "date": "2021-2023",
          "subtitle": "Sainte Marie Antony",
          "description": "Track followed: MPSI/MP"
        },
        "2": {
          "title": "Baccalaureate",
          "date": "2020-2021",
          "subtitle": "Lakanal Sceaux",
          "description": "Specialties: Mathematics and Physics-Chemistry\nOptions: Advanced Mathematics and Sports"
        }
      }
    },
    "professionalJourney": {
      "title": "Professional",
      "items": {
        "0": {
          "date": "September 2024 - January 2025",
          "title": "Mid-term Internship",
          "subtitle": "DiliTrust La Défense",
          "description": "Member of the ML team at DiliTrust, involved in developing intelligent agents and automating tasks related to document processing."
        },
        "1": {
          "date": "Since April 2023",
          "title": "Co-founder Sterenova",
          "subtitle": "Paris",
          "description": "Founder of Sterenova:\nEvent planning and equipment rental, event organization, business management"
        },
        "2": {
          "date": "August 2022",
          "title": "Waiter/Bartender",
          "subtitle": "Marius Café Pornic"
        },
        "3": {
          "date": "March 2021",
          "title": "Warehouse Worker",
          "subtitle": "PSL France M.I.N Rungis"
        },
        "4": {
          "date": "August 2020",
          "title": "Parts Department Storekeeper",
          "subtitle": "Renault Retail Group Paris"
        }
      }
    }
  },
  "projects": {
    "sterenovaSite": {
      "title": "Sterenova Website",
      "description": "Website development for Sterenova",
      "longDescription": "I built this website with React, TypeScript, and the shadcn UI library. The idea was to have a clear and modern showcase to present our activity.\nWe offer sound and light equipment rental, as well as full services to animate different types of events: birthdays, weddings, rally parties, classic parties, etc.\nWe also DJ, adapt to the desired vibe, and handle the technical side so everything runs smoothly.\nThe website provides an overview of what we do, along with some practical information to contact us."
    },
    "agentIA": {
      "title": "ChatGPT AI Agent",
      "description": "Automatic documentation generation with Slack + scraping",
      "longDescription": "As part of my internship, I developed a technical documentation generator.\nThe goal was to centralize and automatically produce documentation from different sources, using scraping to gather content.\nI then used the ChatGPT API to generate structured texts from this data, building prompts tailored to the type of information retrieved.\nOnce the service was running, I integrated it into Slack as a bot, accessible to all team members.\nThis project helped save time on writing and updating internal documents while making access to information easier for everyone."
    },
    "classificationContrats": {
      "title": "Contract Classification",
      "description": "Internal LLMs to recognize legal documents",
      "longDescription": "During my internship, I worked on a project for automatic contract classification using an intern LLM.\nThe goal was to categorize contracts by type (services, confidentiality, partnerships, etc.) to make sorting and management easier.\n\nI designed a multi-step pipeline, relying on prompts to guide the LLM’s reasoning.\nThe first step extracted key elements from the raw contract text. Then, the model evaluated the contract type based on legal or structural criteria.\nI implemented a system to group contracts into families, handling ambiguous or conflicting cases with targeted follow-ups or additional prompts to clarify context.\n\nOne advantage of this approach is that it doesn’t require training a supervised model on a specific dataset.\nThis makes it much easier to adapt to new contracts with different structures or layouts while maintaining consistent classification.\nBy using well-crafted prompts, the LLM focuses on content rather than form, which improves the system’s generalization capability.\n\nThis project laid the groundwork for an internal tool capable of automating a typically manual task, while keeping the process transparent and explainable."
    },
    "portfolio": {
      "title": "My Portfolio",
      "description": "Personal website to showcase my projects and skills",
      "longDescription": "This portfolio website serves as a showcase for my projects and skills, highlighting my work and achievements in the field."
    }
  },
  "courseProjects": {
    "pfee": {
      "title": "PFEE",
      "description": "AI-based automatic football match analysis tool, with player detection, ID tracking, and statistics generation from videos, aimed at amateur clubs.",
      "longDescription": "In this ongoing project, we are developing an AI-based tool to automatically analyze football matches from videos, with a clear goal: to provide detailed statistics to amateur clubs, often lacking advanced technological means.\nThe first phase focuses on player tracking. For this, we use YOLOv11, the latest version of the well-known object detection model. The tracking is done in three main steps:\nInitial object detection (players, ball, referees) on each frame with YOLO.\nInter-frame tracking based on spatial proximity: if two detected objects across consecutive frames are close, they are considered the same player. This step uses YOLO’s built-in tracking.\nRe-identification (Re-ID): to handle cases where a player leaves and re-enters the camera view, we generate a unique embedding for each player to assign them a constant ID throughout the match.\n\nWe use the SoccerNet dataset, which provides many annotated videos, allowing us to evaluate our tracking system in a supervised manner.\nAlongside tracking, we applied clustering techniques to identify referees and determine which team each player belongs to.\nThese first steps will lay the groundwork for later phases, aiming to detect match events (passes, shots, fouls, etc.) and automatically generate useful statistics for coaches and clubs."
    },
    "musicGenerator": {
      "title": "Music Generator",
      "description": "Using BERT to generate music for an NLP course project",
      "longDescription": "As part of an NLP project, I worked on a melody generator based on a method similar to natural language processing.\nThe idea was to treat music as a sequence of symbols, considering notes as letters or words, to predict the next note in a melody, similar to predicting the next word in a sentence.\n\nAs input, the model takes a chord progression (e.g., G, A, D, Em). For each chord, we extract the notes of its arpeggio, which provides a coherent harmonic base.\nFrom this base, the goal is to generate a melodic line that stays musical, respecting the chord progression while introducing some variation.\n\nTo model the sequence, I used a BERT-based model adapted to this musical representation.\nBERT is typically used to understand sentence context: here, it was used to understand the “harmonic context” and propose the most relevant continuation note by note.\nWith this approach, we get a melody anchored in the given chords, while allowing creativity in melodic progression."
    },
    "imageClassification": {
      "title": "Image Classification",
      "description": "Using CNNs to classify images in an image classification course project",
      "longDescription": "In this project, I built a convolutional neural network (CNN) to classify ten different types of galaxies from their photos.\nI worked with a labeled dataset, which allowed me to train the model in a supervised way.\n\nCNNs are well-suited for visual data thanks to their ability to extract important features (shapes, textures, patterns) without manual feature engineering.\nI designed and trained a model capable of recognizing subtle differences between galaxy types, adjusting convolutional, pooling, and fully connected layers to optimize performance.\n\nThe process also included preprocessing images (resizing, normalization).\nAfter several iterations and hyperparameter adjustments, the model achieved good classification accuracy.\nYou can find a detailed report of this work here:"
    },
    "dataExploration": {
      "title": "Data Exploration",
      "description": "Data analysis for a data science course project",
      "longDescription": "For this data exploration project, I chose to work on a volleyball-related dataset.\nThe goal was to analyze different questions around individual and team performance in this sport.\n\nI kept 3 questions:\nWho are the most effective players?\nDoes a player’s height influence their position choice?\nWhat are the key factors that determine a team’s victory?\n\nThe work involved cleaning and preparing the data, creating a complete dataset profile, then building visualizations to better understand trends.\nBased on initial results, we iterated by refining questions and deepening the analysis.\n\nThis project explores volleyball through data, highlighting important aspects for both players and teams.\nYou can find a full report detailing the entire analysis here:"
    },
    "dataScience": {
      "title": "Data Science",
      "description": "Analysis and prediction of road accidents using real data",
      "longDescription": "As part of this project, I worked on a dataset related to road accidents, aiming to understand the factors influencing their severity, frequency, or location, and to explore predictive approaches with machine learning.\n\nThe project went through several steps: data cleaning and processing, exploratory analysis and visualizations, then modeling with supervised and unsupervised approaches.\nOne of the first questions was: can we predict accident severity? We also went further by exploring other angles.\n\nSeveral models were tested, compared, and evaluated with appropriate metrics, and the results were interpreted using visualizations.\n\nThis project combines data processing, machine learning, and visualization skills to extract concrete insights from real-world data.\nYou can find all the details of the analysis and results in the following report:"
    }
  },
  "sterenova": {
    "title": "Sterenova – Tailor-made Events",
    "intro": "We are three friends with a common passion: sound, lights, and turntables.\nAt first, we only had a bit of equipment and a lot of enthusiasm. Then, from party to party, we got more gear, learned, and saw our project grow.\nToday, we bring our equipment to your events: birthdays, weddings, rally parties, or simply gatherings with friends. We handle the music, lights, and all the technical aspects so you can enjoy yourself worry-free.\nIn the end, we aim to make your party how we’d like ours to be: simple, smooth, and memorable.",
    "button": "Our Website"
  },
  "sports": {
    "title": "My Sports",
    "gym": {
      "name": "Weight Training",
      "img": "/images/sports/gym_43.jpg",
      "description": "I have been doing weight training for a little over two years, sometimes alone, sometimes with friends. It’s a good way to stay fit and helps me stay consistent in everything I do."
    },
    "tennis": {
      "name": "Tennis",
      "img": "/images/sports/tennis_43.jpg",
      "description": "The sport I have practiced the longest. I have played both singles and team matches. Team matches are a great memory since the collective game makes you stronger. This sport mostly pushes me to improve a little more each time, both technically and mentally."
    },
    "climbing": {
      "name": "Climbing",
      "img": "/images/sports/climbing_43.jpg",
      "description": "I started climbing in high school, and today I prefer climbing outdoors on natural routes. It’s a sport that requires focus and strength, and where mutual trust between climber and belayer is essential."
    },
    "winterSports": {
      "name": "Winter Sports",
      "img": "/images/sports/snowboard_43.jpg",
      "description": "I started skiing very young, then switched to snowboarding in recent years. I enjoy speed and doing tricks on the slopes."
    },
    "volley": {
      "name": "Volleyball",
      "img": "/images/sports/volley_43.jpg",
      "description": "A team sport that requires coordination and communication. Playing on the beach is also a great way to meet new people and share good moments."
    }
  },
  "music": {
    "title": "Music",
    "guitarTitle": "The Guitar",
    "djTitle": "DJ",
    "intro": "Music has been part of my life for a long time. I started with guitar, and today I continue this passion through my DJ projects with Sterenova. I also taught myself some piano, more out of curiosity than seriousness, to explore another instrument.",
    "guitar": "I have been playing guitar for over 15 years, with a lot of focus on improvisation. In high school, I was the lead guitarist in a band for a year, a remarkable experience that enriched my practice and reinforced the joy of playing in a group.",
    "dj": "I DJ at parties, weddings, and events, which allows me to stay close to music and share moments with the audience. I enjoy mixing different styles to create something new from what already exists."
  },
    "contact": {
    "title" : "Contact me",
    "description": "Feel free to contact me or download my resume."
  }
}
