{
  "header": {
    "presentation": "Accueil",
    "parcours": "Parcours",
    "projects": "Projets",
    "contact": "Me contacter",
    "backhome": "Retour à l'accueil",
    "persoProjects": "Projets professionels réalisés",
    "courseProjects": "Projets universitaires réalisés",
    "link": "Rapport",
    "seeMore": "Voir plus"
  },
  "about": {
    "title": "Acceuil",
    "description": "Etudiant à EPITA en majeure SCIA-G (Data Science, IA & Graphes).\nCe site, c’est un peu mon labo perso :\nIci je partage ce que j’apprends, ce que je construis, et ce qui m’inspire."
  },
  "parcours": {
    "title": "Parcours",
    "academicJourney": {
      "title": "Académique",
      "items": {
        "0": {
          "title": "EPITA",
          "date": "2023 - Actuellement",
          "subtitle": "Paris",
          "description": "Cycle ingénieur – Promotion 2026\nMajeure SCIA-G : Data Science, Intelligence Artificielle et Graphes"
        },
        "1": {
          "title": "Prépa CPGE",
          "date": "2021-2023",
          "subtitle": "Sainte Marie Antony",
          "description": "Filière suivie : MPSI/MP"
        },
        "2": {
          "title": "Baccalauréat",
          "date": "2020-2021",
          "subtitle": "Lakanal Sceaux",
          "description": "Spécialités suivies : mathématiques et physique-chimie\nOptions choisies : mathématiques expertes et sport"
        }
      }
    },
    "professionalJourney": {
      "title": "Professionnel",
      "items": {
        "0": {
          "date": "Septembre 2025",
          "title": "Développeur commercial IT",
          "subtitle": "JECT EPITA",
          "description": "J'identifie les besoins des entreprises, rédige des propositions commerciales et assure un suivi complet des projets IT entre les clients et les parties prenantes."
        },
        "1": {
          "date": "Septembre 2024 - janvier 2025",
          "title": "Stage mi- étude",
          "subtitle": "DiliTrust La Défense",
          "description": "Membre de l’équipe ML chez DiliTrust, impliqué dans le développement d’agents intelligents et l’automatisation de tâches liées au traitement de documents."
        },
        "2": {
          "date": "Depuis avril 2023",
          "title": "Co-créateur Sterenova",
          "subtitle": "Paris",
          "description": "Fondateur de Sterenova:\névènementiel et location de matériel, planification d'évènement, gestion d'entreprise"
        },
        "3": {
          "date": "Août 2022",
          "title": "Serveur/Barman",
          "subtitle": "Marius Café Pornic"
        },
        "4": {
          "date": "Mars 2021",
          "title": "Manutentionnaire",
          "subtitle": "PSL France M.I.N Rungis"
        },
        "5": {
          "date": "Août 2020",
          "title": "Magasinier au service Pièces de Rechange",
          "subtitle": "Renault Retail Group Paris"
        }
      }
    }
  },
  "projects": {
    "sterenovaSite": {
      "title": "Site Internet Sterenova",
      "description": "Développement du site web pour Sterenova",
      "longDescription": "J’ai créé ce site avec React, TypeScript et la librairie UI shadcn. L’idée était d’avoir une vitrine claire et moderne pour présenter notre activité.\nOn propose de la location de matériel son et lumière, mais aussi des prestations complètes pour animer différents types d’évènements : anniversaires, mariages, soirées rallye, soirées classiques, etc.\nOn mixe en tant que DJ, on s’adapte à l’ambiance souhaitée et on s’occupe de la partie technique pour que tout se passe au mieux.\nLe site est là pour donner un aperçu de ce qu’on fait, avec quelques informations pratiques pour nous contacter."
    },
    "agentIA": {
      "title": "Agent IA ChatGPT",
      "description": "Génération automatique de documentation avec Slack + scraping",
      "longDescription": "Dans le cadre de mon stage, j’ai développé un générateur de documentation technique.\nL’objectif était de centraliser et produire automatiquement de la documentation à partir de différentes sources, en utilisant du scrapping pour récupérer les contenus.\nJ’ai ensuite utilisé l’API de ChatGPT pour générer des textes structurés à partir de ces données, en construisant des prompts adaptés selon le type d’information récupérée.\nUne fois le service en place, je l’ai intégré à Slack sous forme de bot, accessible à tous les membres de l’équipe.\nCe projet a permis de gagner du temps sur la rédaction et la mise à jour des documents internes, tout en rendant l’accès à l’information plus simple pour tout le monde."
    },
    "classificationContrats": {
      "title": "Classification de Contrats",
      "description": "LLM internes pour reconnaître des documents juridiques",
      "longDescription": "Pendant mon stage, j’ai travaillé sur un projet de classification automatique de contrats à l’aide d'un LLM interne.\nL’objectif était de catégoriser des contrats selon leur type (prestations, confidentialité, partenariats, etc.), afin de faciliter leur tri et leur gestion.\n\nJ’ai conçu un pipeline en plusieurs étapes, en m’appuyant sur des prompts définis pour guider le LLM dans son raisonnement.\nLa première étape consistait à extraire les éléments clés du contrat à partir de son contenu brut. Ensuite, le modèle évaluait le type de contrat en se basant sur des critères juridiques ou structurels.\nJ’ai mis en place un système de regroupement par familles de contrats, tout en gérant les cas ambigus ou conflictuels via des relances ciblées ou des prompts supplémentaires permettant de préciser le contexte.\n\nUn des avantages de cette approche est qu’elle ne nécessite pas d’entraîner un modèle supervisé sur un jeu de données spécifique.\nCela permet de s’adapter beaucoup plus facilement à de nouveaux contrats ayant une structure ou une mise en forme différente, tout en maintenant une classification cohérente.\nL’utilisation de prompts bien construits permet au LLM de s’appuyer sur le fond plutôt que sur la forme, ce qui améliore la capacité de généralisation du système.\n\nCe projet a permis de poser les bases d’un outil interne capable d’automatiser une tâche habituellement très manuelle, tout en gardant une logique transparente et explicable dans le traitement des documents."
    },
    "portfolio": {
      "title": "Mon Portfolio",
      "description": "Site web personnel pour présenter mes projets et compétences",
      "longDescription": "Ce site web portfolio sert de vitrine pour mes projets et compétences, mettant en avant mon travail et mes réalisations dans le domaine."
    }
  },
  "courseProjects": {
    "pfee": {
      "title": "PFEE",
      "description": "Outil d’analyse automatique de matchs de football basé sur l’IA, avec détection des joueurs, suivi par ID et génération de statistiques à partir de vidéos, destiné aux clubs amateurs.",
      "longDescription": "Dans ce projet toujours en cours, nous développons un outil basé sur l’intelligence artificielle pour analyser automatiquement les matchs de football à partir de vidéos, avec un objectif clair : fournir des statistiques détaillées aux clubs amateurs, souvent dépourvus de moyens technologiques avancés.\nLa première phase du projet se concentre sur le tracking des joueurs. Pour cela, nous utilisons YOLOv11, la dernière version du célèbre modèle de détection d’objets. Le suivi des joueurs se fait en trois étapes principales :\nDétection initiale des objets (joueurs, ballon, arbitres) sur chaque frame grâce à YOLO.\nTracking inter-frames basé sur la proximité spatiale : si deux objets détectés sur des images consécutives sont proches, on considère qu’il s’agit du même joueur. Cette étape repose sur le tracking \"classique\" intégré à YOLO.\nRe-identification (Re-ID) : pour gérer les cas où un joueur quitte et revient dans le champ de la caméra, nous générons un embedding unique pour chaque joueur afin de lui attribuer un ID constant tout au long du match, même après disparition temporaire.\n\nNous utilisons le dataset SoccerNet, qui propose un grand nombre de vidéos annotées, ce qui nous permet d’évaluer notre système de tracking de façon supervisée.\nEn complément du tracking, nous avons appliqué des techniques de clustering pour identifier les arbitres et déterminer à quelle équipe appartient chaque joueur.\nCes premières étapes poseront les bases pour les phases suivantes du projet, qui viseront à détecter des événements de match (passes, tirs, fautes, etc.) et à générer automatiquement des statistiques exploitables pour les entraîneurs et clubs."
    },
    "anomalyDetection": {
      "title": "Détection d’anomalies",
      "description": "Projet de détection d’anomalies sur le dataset SWaT, appliqué à un système de traitement d’eau industriel.",
      "longDescription": "Ce projet a été mené dans le cadre du module MLSecu, avec pour objectif de mettre en œuvre différentes techniques de machine learning afin de détecter des comportements anormaux dans un système industriel. Le jeu de données utilisé, SWaT (Secure Water Treatment), provient d’une station expérimentale de traitement de l’eau reproduisant à petite échelle un processus réel de purification. Ce dataset inclut à la fois des périodes de fonctionnement normal et des attaques simulées visant capteurs et actionneurs, offrant un terrain riche pour la détection d’anomalies.\n\nLa première étape du projet a consisté en un prétraitement des données : suppression des valeurs manquantes et inutiles, normalisation des variables et visualisation via une matrice de corrélation. Ces étapes ont permis d’assurer la qualité et la pertinence des données avant d’entraîner différents modèles.\n\nDeux grandes familles d’approches ont été explorées :\n\nLes méthodes non supervisées (Isolation Forest, Local Outlier Factor, One-Class SVM), capables de fonctionner sans données étiquetées mais nécessitant un réglage du taux de contamination. L’étude comparative a montré que l’approche par vote majoritaire entre modèles offrait un bon compromis entre rappel et précision.\n\nLes méthodes supervisées (Random Forest, SVM, Régression Logistique), tirant parti des étiquettes présentes dans le dataset. Le Random Forest a montré les meilleures performances globales, suivi de près par le SVM.\n\nEnfin, une approche hybride a été discutée, combinant la flexibilité du non supervisé et la précision du supervisé, afin de construire une stratégie robuste et adaptée aux environnements industriels dynamiques."
    },
    "musicGenerator": {
      "title": "Générateur de musique",
      "description": "Utilisation de BERT pour générer de la musique dans le cadre d'un projet de cours NLP",
      "longDescription": "Dans le cadre d’un projet en NLP, j’ai travaillé sur un générateur de mélodies basé sur un fonctionnement similaire à celui du traitement du langage naturel.\nL’idée était d’aborder la musique comme une séquence de symboles, en considérant les notes comme des lettres ou des mots, pour ensuite prédire la prochaine note d’une mélodie, un peu comme on prédit le mot suivant dans une phrase.\n\nEn entrée, le modèle prend une grille d’accords (par exemple : G, A, D, Em). Pour chaque accord, on extrait les notes de son arpège, ce qui forme une base harmonique cohérente.\nÀ partir de cette base, le but est de générer une ligne mélodique qui reste musicale, en respectant la progression d’accords tout en ayant une certaine variation.\n\nPour modéliser la séquence, j’ai utilisé un modèle de type BERT, adapté à cette représentation musicale.\nBERT est généralement utilisé pour comprendre le contexte dans une phrase : ici, il est utilisé pour comprendre le \"contexte harmonique\" et proposer la suite la plus pertinente note par note.\nGrâce à cette approche, on obtient une mélodie qui s’ancre dans les accords donnés, tout en laissant place à une certaine créativité dans la suite mélodique."
    },
    "imageClassification": {
      "title": "Classification d'images",
      "description": "Utilisation de CNN pour classifier des images dans le cadre d'un projet de cours de classification d'images",
      "longDescription": "Lors de ce projet, j’ai creé un réseau de neurones convolutifs (CNN) pour classifier dix types différents de galaxies à partir de leur photos.\nJ’ai travaillé avec un dataset d’images labellisées, ce qui m’a permis d’entraîner le modèle en supervision.\n\nLe CNN est adapté à ce type de données visuelles, grâce à sa capacité à extraire des caractéristiques importantes dans les images (formes, textures, motifs) sans besoin de feature engineering manuel.\nJ’ai conçu et entraîné un modèle capable de reconnaître les différences subtiles entre les types de galaxies, en ajustant les couches convolutionnelles, de pooling et les couches fully connected pour optimiser les performances.\n\nLe processus comprenait aussi une phase de prétraitement des images (redimensionnement, normalisation).\nAprès plusieurs itérations et ajustements d’hyperparamètres, le modèle a atteint une bonne précision de classification.\nVous pouvez retrouver un rapport détaillé de ce travail ici :"
    },
    "dataExploration": {
      "title": "Exploration de données",
      "description": "Analyse de données pour un projet de cours de data science",
      "longDescription": "Pour ce projet d’exploration de données, j'ai choisi de travailler sur un dataset lié au volleyball.\nL’objectif était d’analyser différentes questions autour des performances individuelles et collectives dans ce sport.\n\nJ'ai gardé 3 questions:\nQuels sont les joueurs les plus performants ?\nLa taille d’un joueur influence-t-elle le choix de son poste sur le terrain ?\nQuels sont les facteurs clés qui déterminent la victoire d’une équipe ?\n\nLe travail a consisté à préparer et nettoyer les données, réaliser un profil complet du dataset, puis créer des visualisations pour mieux comprendre les tendances.\nÀ partir des premiers résultats, nous avons itéré en affinant les questions et en approfondissant l’analyse.\n\nCe projet permet d’explorer en détail le fonctionnement du volleyball à travers les données, en mettant en lumière des aspects importants tant pour les joueurs que pour les équipes.\nVous pouvez retrouver un rapport complet détaillant toute l’analyse ici :"
    },
    "dataScience": {
      "title": "Data Science",
      "description": "Analyse et prédiction des accidents de la route à partir de données réelles",
      "longDescription": "Dans le cadre de ce projet, j’ai travaillé sur un dataset lié aux accidents de la route, avec pour objectif de comprendre les facteurs qui influencent leur gravité, leur fréquence ou leur localisation, et d’explorer des approches de prédiction à l’aide du machine learning.\n\nLe projet s’est déroulé en plusieurs étapes : nettoyage et traitement des données, analyses exploratoires et visualisations, puis modélisation via des approches supervisées et non-supervisées.\nL’une des premières questions étudiées était : peut-on prédire la sévérité d’un accident ? Mais nous avons également cherché à aller plus loin en explorant d’autres angles d’analyse.\n\nPlusieurs modèles ont été testés, comparés et évalués à l’aide de métriques adaptées, et les résultats ont été interprétés à l’aide de visualisations.\n\nCe projet combine des compétences en traitement de données, machine learning, et visualisation pour tirer des enseignements concrets à partir de données réelles.\nVous pouvez retrouver tous les détails de l’analyse et des résultats dans le rapport suivant :"
    }
  },
  "sterenova": {
    "title": "Sterenova – Évènements sur mesure",
    "intro": "On est trois amis avec une passion commune : le son, les lumières et les platines.\nAu début, on avait juste un peu de matériel et beaucoup d’envie. Puis, de soirée en soirée, on s’est équipés, on a appris, et on a vu notre projet grandir.\nAujourd’hui, on met notre équipement au service de vos évènements : anniversaires, mariages, soirées rallye ou juste des moments entre proches. On s’occupe de la musique, des lumières et de toute la technique pour que vous puissiez profiter sans vous soucier de rien.\nFinalement, on fait en sorte que votre soirée soit comme on aimerait vivre les nôtres : simple, fluide et mémorable.",
    "button": "Notre site"
  },
  "sports": {
    "title": "Mes Sports",
    "gym": {
      "name": "Musculation",
      "img": "/images/sports/gym_43.jpg",
      "description": "Je fais de la musculation depuis un peu plus de deux ans, parfois seul, parfois avec des amis. C’est un bon moyen d'etre en forme et m’aide à rester régulier dans tout ce que je fais."
    },
    "tennis": {
      "name": "Tennis",
      "img": "/images/sports/tennis_43.jpg",
      "description": "Sport que je pratique depuis le plus longtemps. Je joue aussi bien en simple qu’en équipe. Il me pousse surtout à progresser un peu plus à chaque fois, autant sur le plan technique que mental."
    },
    "climbing": {
      "name": "Escalade",
      "img": "/images/sports/climbing_43.jpg",
      "description": "J’ai commencé l’escalade au lycée, et aujourd’hui je préfère grimper en montagne sur des voies naturelles, un sport qui demande concentration et force, et où la confiance est mutuelle entre celui qui grimpe et celui qui assure."
    },
    "winterSports": {
      "name": "Sport d'hiver",
      "img": "/images/sports/snowboard_43.jpg",
      "description": "J’ai commencé le ski très jeune, puis je me suis mis au snowboard ces dernières années. J'aime la vitesse et faire des figures sur les pistes."
    },
    "volley": {
      "name": "Volleyball",
      "img": "/images/sports/volley_43.jpg",
      "description": "Sport d’équipe qui demande coordination et communication. En joueant sur la plage cela permet rencontrer de nouvelles personnes et de partager de bons moments."
    }
  },
  "music": {
    "title": "Musique",
    "guitarTitle": "La Guitare",
    "djTitle": "DJ",
    "intro": "La musique fait partie de ma vie depuis longtemps. J’ai commencé avec la guitare, et aujourd’hui je continue cette passion à travers mes projets DJ avec Sterenova. J’ai aussi fait un peu de piano en autodidacte, plus par curiosité que par sérieux, afin d’explorer un autre instrument.",
    "guitar": "Je pratique la guitare depuis plus de 15 ans, avec une grande place laissée à l’improvisation. En terminale, j’ai été guitariste leader dans un groupe pendant un an, une expérience marquante qui a enrichi ma pratique et renforcé le plaisir de jouer en collectif.",
    "dj": "Je mixe lors de soirées, mariages et évènements, ce qui me permet de rester proche de la musique et de partager des moments avec le public. J’aime mélanger différents styles pour créer quelque chose de nouveau à partir de ce qui existe déjà."
  },
  "contact": {
    "title": "Me contacter",
    "description": "N’hésitez pas à me contacter ou à télécharger mon CV."
  }
}
